import { ContentWrapper } from '@/components/modules/ContentWrapper'
import { Text } from '@/components/UI/Text'

export default async function PublickOffertPage() {
	return (
		<>
			<ContentWrapper title='Договор публичной оферты на приобретение товаров через Интернет-магазин'>
				<div className='flex items-center '>
					<div className='mr-10'>
						<div className='text-xl'>
							<span>
								Настоящий договор (именуемый далее – Договор), заключаемый в порядке статей 396, 398 Гражданского
								кодекса Республики Беларусь, определяет порядок продажи товаров через Интернет-магазин
								https://www.smarttech.by/, а также взаимные права, обязанности и порядок взаимоотношений между Обществом
								с ограниченной ответственностью «СМАРТЕЧ», именуемое в дальнейшем «Продавец», в лице директора Снытко
								А.И., действующей на основании Устава, с одной стороны, и Покупателем, принявшим публичное предложение
								(оферту) о заключении настоящего Договора.
							</span>
							<Text className='text-2xl font-semibold py-7'>1. Общие положения.</Text>
							<ul className=''>
								<li className='flex mb-3'>
									<p>
										1.1. Фактом принятия (акцепта) Покупателем условий настоящего Договора является сообщение о выборе и
										заказе товара, отправленное путем телефонной связи, а также нажатия кнопки «Оформить заказ» в
										разделе «Корзина» посредством электронной связи, в порядке и на условиях, определенных настоящим
										Договором и условиями (п.3 ст.408 Гражданского Кодекса Республики Беларусь).
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.2. При совместном упоминании Покупателя и Продавца по тексту настоящего договора последние
										именуются Стороны, а каждый по отдельности Сторона.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.3. Каждая Сторона гарантирует другой Стороне, что обладает соответствующим правом и достаточным
										объемом дееспособности, а равно всеми иными правами и полномочиями, необходимыми для заключения и
										исполнения настоящего договора.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.4. Осуществляя Заказ Товара через Интернет-магазин, Покупатель принимает и соглашается со всеми
										условиями, изложенными в настоящем договоре, и с информацией, размещенной на Интернет-Сайте
										https://www.smarttech.by (далее по тексту – Сайт) в момент принятия Продавцом Заказа.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.5. К отношениям между Сторонами по настоящему договору применяются требования Закона Республики
										Беларусь от 08.01.2014 №128-З «О государственном регулировании торговли и общественного питания в
										Республике Беларусь», Закона Республики Беларусь от 09.01.2002 №90-З «О защите прав потребителей»
										(далее – Закон) и иные правовые акты Республики Беларусь, регулирующие вопросы розничной
										купли-продажи.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.6. Продавец оставляет за собой право вносить изменения в настоящий договор и в информацию на
										Сайте, в связи, с чем Покупатель обязуется на момент обращения к Продавцу с Заказом на Товар
										учитывать возможные изменения.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										1.7. Публикация информации, очевидно не соответствующей товару, в том числе цены, фото и описания
										товара, признается технической ошибкой.
									</p>
								</li>
							</ul>
							<p className='text-2xl font-semibold py-7'>2. Предмет договора.</p>
							<ul className=''>
								<li className='flex mb-3'>
									<p>
										2.1. Продавец, на основании поступившего заказа от Покупателя, продает, а Покупатель производит
										оплату и принимает заказанный Товар на условиях настоящего Договора.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										2.2. Товар представлен на Сайте через фото-образцы. Каждый фото-образец сопровождается текстовой
										информацией: артикулом, ценой и описанием товара. Фото-образец может отличаться от реального
										внешнего вида товара (Монитор Покупателя искажает цвета и т.д.)
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										2.3. По просьбе Покупателя Продавец обязан предоставить (по телефону или посредством электронной
										почты) прочую информацию, необходимую и достаточную, с точки зрения Покупателя, для принятия им
										решения о покупке товара.
									</p>
								</li>
							</ul>
							<p className='text-2xl font-semibold py-7'>3. Оформление и сроки выполнения заказа.</p>
							<ul className=''>
								<li className='flex mb-3'>
									<ul className='mb-5'>
										<li className=' mb-5'>
											<p>3.1. Заказ Покупателя может быть оформлен по телефону и/или через Сайт.</p>
										</li>
										<li className='flex mb-3'>
											<p>
												3.1.1. При оформлении Заказа по телефону Покупатель предоставляет Продавцу следующую необходимую
												информацию для оформления Заказа: желаемый товар и количество, адрес доставки товара, контактный
												телефон, желаемое время получения заказа.
											</p>
										</li>
										<li className='flex mb-5'>
											<p>
												3.1.2. При оформлении Заказа через Сайт Покупатель заполняет электронную форму Заказа на Товар и
												отправляет сформированный Заказ Продавцу посредством сети Интернет.
											</p>
										</li>
										<li className='flex mb-5'>
											<p>
												3.2. Информация в Заказе, полученном Продавцом, согласовывается с Покупателем либо Получателем
												по контактному телефону с целью уточнения, в том числе, конкретной даты и времени доставки
												Товара. Конкретная дата и время доставки зависят от выбранного товара, места доставки и времени,
												необходимого Продавцу на обработку Заказа.
											</p>
										</li>
									</ul>
								</li>

								<li className='flex mb-5'>
									<p>
										3.3. В случае обнаружения, что на складе Продавца отсутствует необходимый Товар или необходимое его
										количество, Продавец информирует об этом Покупателя по контактному телефону, отраженному в Заказе.
										Покупатель вправе согласиться принять Товар в количестве, имеющемся в наличии у Продавца, либо
										отказаться (аннулировать) от Заказа.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										3.4. В случае возникновения у Покупателя вопросов, касающихся описания, свойств и характеристик
										Товара, перед оформлением Заказа Покупатель должен обратиться к Продавцу по телефонам или с помощью
										средств онлайн-консультации, указанным на Сайте Интернет-магазина.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										3.5. Продавец вправе отказать клиенту в подтверждении или выполнении заказа в случае обнаружения в
										нем технической ошибки, связанной с работой программного обеспечения на стороне Продавца, либо
										обеспечивающих его функционирование сторонних сервисов, в том числе явившейся следствием
										неправомерных действий со стороны третьих лиц.
									</p>
								</li>
							</ul>
							<p className='text-2xl font-semibold py-7'>4. Доставка товара.</p>
							<ul className=''>
								<li className='flex mb-3'>
									<p>4.1. С условиями доставки Товара можно ознакомиться на Сайте.</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.2. В момент приемки товара Покупатель проверяет внешний вид и комплектность товара. Если товар
										имеет внешние недостатки, механические повреждения Покупатель вправе отказаться от товара. Проверка
										Товара должна производиться с сохранением товарного вида.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.3. Покупатель или Получатель в момент получения товара получает: кассовый чек, при условии, что
										оплата производится в момент получения заказа;инструкцию по сборке (эксплуатации) Товара и (или)
										паспорт на изделие, если это предусмотрено заводом изготовителем.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.4. В случае получения Товара Покупателем или Получателем в пункте выдачи товаров, Покупатель
										обязуется получить Товар в срок не позднее 7 календарных дней с момента уведомления Продавца о
										готовности Товара к передаче.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.5. Хранение Товара на складе Продавца в течение срока, указанного в п. 4.4. осуществляется
										Продавцом на безвозмездной основе.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.6. В случае, если Товар не был передан Покупателю в сроки указанные в п. 4.4. Договора по вине
										Покупателя, Продавец направляет Покупателю уведомление о необходимости забрать свой товар.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.7. При неисполнении Покупателем обязанности забрать свой товар, переданный на хранение Продавцу, в
										течение 7 календарных дней с момента получения уведомления, Продавец вправе аннулировать заказ и
										произвести возврат уплаченных Покупателем денежных средств.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										4.8. С момента передачи Товара, Покупателю переходит право собственности (ст. 224 ГК), бремя
										содержания, принадлежащее собственнику имущества (ст. 211 ГК), а также риск случайной гибели или
										случайного повреждения товара (ст. 212 ГК).
									</p>
								</li>
							</ul>
							<p className='text-2xl font-semibold py-7'>5. Оплата товара.</p>
							<ul className=''>
								<li className='flex mb-3'>
									<p>
										5.1. Цена Товара указывается рядом с определенным наименованием товара на Сайте Интернет-магазина на
										странице товара в белорусских рублях.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										5.2. Цена Товара на Сайте Интернет-магазина может быть изменена Продавцом в одностороннем порядке.
										При этом цена на Товар, на который оформлен Заказ, изменению не подлежит.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										5.3. Оплата Товара Покупателем или Получателем производится в белорусских рублях в форме и
										способами, указанными Продавцом в разделе «Доставка и оплата» на Сайте Интернет-магазина.
									</p>
								</li>
								<li className='flex mb-5'>
									<p>
										5.4. Продавец вправе проводить акции путем предложения скидок, подарков и др. условий. Виды акций,
										их описание, условия участия и сроки указываются на Сайте Интернет-магазина в публичном доступе и
										могут быть изменены Продавцом в одностороннем порядке.
									</p>
								</li>
							</ul>

							<Text className='text-2xl font-semibold py-7'>6. Гарантии и ответственность.</Text>
							<ul className=''>
								<li className='flex mb-3 mb-5'>
									<Text>
										6.1. Продавец не несет ответственности за ущерб, причиненный Покупателю или Получателю вследствие
										ненадлежащего использования последними Товара, приобретенного в Интернет-магазине Продавца.
									</Text>
								</li>
								<ul className='list-disc mb-5'>
									<Text>
										6.2. Продавец вправе переуступать либо каким-либо иным способом передавать свои права и обязанности,
										вытекающие из его отношений с Покупателем или Получателем третьим лицам.
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										6.3. Продавец не несет ответственности за последствия связанные с действиями Покупателя или
										Получателя в случае использования Товара приобретенного у Продавца в предпринимательских целях
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>6.4. Продавец не отвечает за убытки Покупателя или Получателя возникшие в результате:</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										- предоставления не достоверной информации при согласовании Заказа в т.ч. неправильного указания
										идентификационных сведений;
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>- неправомерных действий третьих лиц</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										6.5. Покупатель или Получатель несет полную ответственность за достоверность идентификационных
										сведений указанных им при Заказе Товара в Интернет-магазина
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										6.6. Стороны освобождаются от ответственности за полное или частичное неисполнение своих
										обязательств если такое неисполнение явилось следствием действия обстоятельств непреодолимой силы
										возникших после вступления в силу настоящего договора и/или в результате событий чрезвычайного
										характера которые Стороны не могли предвидеть и предотвратить разумными мерами
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										6.7. В иных случаях не предусмотренных положениями настоящего договора за неисполнение или
										ненадлежащее исполнение своих обязательств Стороны несут ответственность в соответствии с
										действующим законодательством Республики Беларусь
									</Text>
								</ul>
								<ul className='list-disc mb-5'>
									<Text>
										6.8. В случае необоснованного отказа от приобретения товара Покупатель обязан возместить расходы
										Продавца связанные с доставкой Товара Покупателю
									</Text>
								</ul>{' '}
							</ul>

							<Text className='text-xl font-semibold py-7'>7. Качество возврат и обмен заказа</Text>
							<ul className='list-disc mb-5'>
								<Text>
									7.1 Качество комплектность товара должны соответствовать требованиям действующих технических
									нормативных правовых актов (ТНПА)
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.2 Продавец обязан передать Покупателю Товар который полностью соответствует его Заказу качество
									которого соответствует информации представленной Покупателю при заключении договора а также информации
									доведенной до его сведения при передаче Товара
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>7.3 Изделия бывшие в употреблении к возврату не принимаются</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.4 Покупатель которому передан Товар ненадлежащего качества если его недостатки не были оговорены
									Продавцом вправе потребовать замены такого Товара товаром надлежащего качества только после получения
									заключения сервисного центра о ненадлежащем качестве товара В отношении технически сложных товаров
									перечень которых утвержден Правительством Республики Беларусь Покупатель в случае обнаружения в нем
									недостатка вправе предъявить указанные требования в течение 30 дней со дня передачи товара Продавцом
									Покупателю пункт 7 статьи 20 Закона Республики Беларусь от 9 января 2002 г № 90-З О защите прав
									потребителей Справочно В указанный перечень включены в том числе холодильники морозильники стиральные
									машины автоматические и полуавтоматические посудомоечные машины варочные панели электроплиты с духовым
									шкафом телевизоры видеоаппаратура компьютеры персональные планшеты ноутбуки и периферийные устройства
									к ним отопительное оборудование смартфоны фотоаппараты и другие
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.5 До заключения настоящего договора Покупатель ознакомился с нормативными правовыми актами
									Республики Беларусь регламентирующими розничную торговлю по образцам текстом настоящего договора а
									также информацией о приобретаемом товаре В момент заключения настоящего договора покупатель
									подтверждает обладание достаточной информации о товаре о порядке торговли по образцам и соглашается со
									всеми условиями настоящего договора без каких-либо оговорок и или изъятий из него
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.6 Возврату не подлежат технически сложные товары бытового назначения надлежащего качества указанные
									в Перечне непродовольственных товаров надлежащего качества не подлежащих возврату или обмену согласно
									действующему законодательству
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.7 Возврат товара надлежащего качества возможен по усмотрению Продавца в случае если сохранены его
									товарный вид упаковка потребительские свойства а также документ подтверждающий факт и условия покупки
									указанного товара Покупатель предоставляет копии указанных документов и заполняет заявление на возврат
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>
									7.8 Для возврата товара а также в случае предъявления претензий к качеству товара необходимо заполнить
									заявление на возврат подробно указав какой именно дефект содержит возвращаемый товар аккуратно
									упаковать товар к возврату вложить товарный чек заполненное заявление прозрачный пакет в котором была
									модель
								</Text>
							</ul>
							<ul className='list-disc mb-5'>
								<Text>7.9 Товар возвращается Покупателем самостоятельно</Text>
							</ul>
							<div>
								<Text className='text-xl font-semibold py-7'>8 Персональные данные</Text>
								<div>
									<div>
										<h4>
											8.1 Стороны безоговорочно соглашаются под реквизитами Покупателя считать информацию указанную им
											при оформлении заказа на покупку товаров в интернет-магазине https://www.smarttech.by/
										</h4>
										<h4>
											8.2 Осуществляя Заказ Товара на Интернет-сайте https://www.smarttech.by/ Покупатель дает согласие
											на сбор и обработку персональных данных о себе в целях осуществления доставки заказанного Товара и
											исполнения условий настоящего договора Продавец собирает и обрабатывает персональные данные
											Покупателей а именно фамилия имя отчество Покупателя адрес доставки контактные телефоны и пр) в
											целях выполнения условий настоящего Договора; доставки Покупателю заказанного Товара; возврата
											Покупателю средств за не подошедшую модель;Продавец обязуется соблюдать конфиденциальность в
											отношении персональных данных Покупателей; не допускать попытки несанкционированного использования
											персональных данных Покупателей третьими лицами; исключить доступ к персональным данным
											Покупателей лиц не имеющих непосредственного отношения к исполнению Заказов за исключением лиц
											имеющих права доступа к данной информации в соответствии с законодательством
										</h4>
									</div>
									<div>
										<p className='text-2xl font-semibold py-7'>9. Прочие условия</p>
										<ul>
											<li className='flex mb-5'>
												<p>9.1. К отношениям между Покупателем и Продавцом применяется право Республики Беларусь.</p>
											</li>
											<li className='flex mb-5'>
												<p>
													9.2. В случае возникновения вопросов и претензий со стороны Покупателя или Получателя, он
													должен обратиться к Продавцу по телефонам, указанным на странице «Главная».
												</p>
											</li>
											<li className='flex mb-5'>
												<p>
													9.3. Все возникающие споры Стороны будут стараться решить путем переговоров. При недостижении
													обоюдовыгодного соглашения, спор между Сторонами будет передан на рассмотрение в суд в
													соответствии с законодательством Республики Беларусь.
												</p>
											</li>
											<li className='flex mb-5'>
												<p>
													9.4. Признание судом недействительности какого-либо положения настоящего договора не влечет за
													собой недействительность его остальных положений.
												</p>
											</li>
											<li className='flex mb-5'>
												<p>
													9.5. Продавец имеет право использовать электронный адрес и телефонные номера Покупателя для
													рассылки информационных сообщений.
												</p>
											</li>
											<li className=' mb-3'>
												<p>
													9.6. Продавец имеет право перед поставкой заказанного Покупателем товара потребовать от
													Клиента 100 % предоплаты заказанного товара. Продавец имеет право отказать Покупателю в
													доставке товара при отсутствии такой оплаты. Продавец имеет право потребовать от Покупателя
													100 % предоплаты заказанного товара в следующих случаях:
												</p>

												<ul className='mb-3'>
													<li>
														<p>
															- если Покупатель ранее совершал заказы, но отказывался от выкупа заказанных товаров,
															доставленных в срок и в надлежащем качестве;
														</p>
													</li>
													<li className='flex mb-5'>
														<p>- по иным причинам на усмотрение Интернет-магазина.</p>
													</li>
												</ul>
											</li>
											<li className='flex mb-5'>
												<p>9.7. Продавец вправе произвести ограничения одновременно доставляемого Покупателю Товара.</p>
											</li>
											<li className='flex mb-5'>
												<p>
													9.8. Продавец вправе не подтвердить либо аннулировать заказ и уведомить об этом Покупателя,
													отказать в оплате и/или продаже Товара по указанной цене, если она явилась следствием
													технической ошибки или неправомерных действий со стороны третьих лиц.
												</p>
											</li>
										</ul>
										<p className='text-2xl font-semibold py-7'>10. Реквизиты Продавца.</p>
										<div className='text-lg'>
											<p>Общество с ограниченной ответственностью «СМАРТЕЧ»</p>
											<p>220073 г. Минск, ул. Бирюзова, д. 12А, каб. 6</p>
											<p>УНП 193732812</p>
											<p>р/с BY92 ALFA30122E40530010270000 в ЗАО «Альфа-Банк»,</p>
											<p>ALFABY2X</p>
											<p>
												<br />
											</p>
											<p>Директор А.И. Снытко</p>
										</div>
									</div>
								</div>
							</div>
						</div>
					</div>
				</div>
			</ContentWrapper>
		</>
	)
}
